# EnergyAnalysisMasszoneDivideperimeter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EnergyAnalysisMasszoneDivideperimeter Property
ParameterTypeId Class See Also
---
"Perimeter Zone Division"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EnergyAnalysisMasszoneDivideperimeter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnergyAnalysisMasszoneDivideperimeter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EnergyAnalysisMasszoneDivideperimeter {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace